# Pandas equivalents for common SQL operations
- this notebook shows the Pandas equivalents for some common SQL operations

# Import libraries and ingest data
- load one sheet from the streetcar delay dataset into a Pandas dataframe

In [26]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import datetime
import os

In [27]:
# get the directory for that this notebook is in
rawpath = os.getcwd()
print("raw path is",rawpath)

raw path is C:\personal\manning\deep_learning_for_structured_data\notebooks

In [28]:
# data is in a directory called "data" that is a sibling to the directory containing the notebook
# this code assumes you have copied to this directory all the XLS files from the source dataset: https://www.toronto.ca/city-government/data-research-maps/open-data/open-data-catalogue/#e8f359f0-2f47-3058-bf64-6ec488de52da
path = os.path.abspath(os.path.join(rawpath, '..', 'data'))
print("path is", path)

path is C:\personal\manning\deep_learning_for_structured_data\data

In [29]:
# dataset into Pandas dataframe
file = "Streetcar Jan 2014.csv"
streetcarjan2014=pd.read_csv(os.path.join(path,file))

# Show SQL / Pandas equivalent statements
- in the following cells, each Python statement is preceded by a comment that shows the SQL that would produce the same result as the Python statement

In [30]:
# select * from streetcarjan2014 limit 3
streetcarjan2014.head(3)

,Report Date,Route,Time,Day,Location,Incident,Min Delay,Min Gap,Direction,Vehicle
0,2014-01-02,505,6:31:00 AM,Thursday,Dundas and Roncesvalles,Late Leaving Garage,4,8.0,E/B,4018.0
1,2014-01-02,504,12:43:00 PM,Thursday,King and Shaw,Utilized Off Route,20,22.0,E/B,4128.0
2,2014-01-02,501,2:01:00 PM,Thursday,Kingston road and Bingham,Held By,13,19.0,W/B,4016.0

In [31]:
# single condition on a Select
# select "Route" from streetcarjan2014 where "Location " = 'King and Shaw'
streetcarjan2014[streetcarjan2014.Location == "King and Shaw"].Route

1    504
Name: Route, dtype: int64

In [32]:
# unique entries in a column
# select distinct "Incident" from streetcarjan2014
streetcarjan2014.Incident.unique()

array(['Late Leaving Garage', 'Utilized Off Route', 'Held By',
       'Investigation', 'Mechanical', 'General Delay',
       'Emergency Services', 'Diversion'], dtype=object)

In [33]:
# multiple conditions on a Select
# select * from streetcarjan2014 where 'Min Delay' > 20 and Day = "Sunday"
streetcarjan2014[(streetcarjan2014['Min Delay'] > 20) & (streetcarjan2014['Day'] == "Sunday")]

,Report Date,Route,Time,Day,Location,Incident,Min Delay,Min Gap,Direction,Vehicle
305,2014-01-19,504,8:33:00 AM,Sunday,King and Queen,Held By,40,50.0,E/B,4089.0
311,2014-01-19,511,7:17:00 PM,Sunday,Bathurst and Front,Investigation,33,40.0,S/B,4179.0

In [34]:
# ORDER BY
# select "Route", "Min Delay" from streetcarjan2014 where "Min Delay" > 20 order by "Min Delay"
streetcarjan2014[['Route','Min Delay']][(streetcarjan2014['Min Delay'] > 20)].sort_values('Min Delay')

     Route  Min Delay
148    501         22
271    501         22
277    506         23
296    506         25
295    504         25
298    511         27
297    504         28
293    505         33
300    511         33
311    511         33
304    504         35
305    504         40
286    512         42
299    511         66
291    506         74
237    504         77
236    501         93